; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	image1 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	Star9 - direction
	GroundStation11 - direction
	GroundStation14 - direction
	GroundStation12 - direction
	Star2 - direction
	Star6 - direction
	GroundStation13 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation0 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation12)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet21)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Planet15 thermograph2)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
	(have_image Phenomenon20 thermograph2)
	(have_image Planet21 thermograph0)
))

)

; plan
1. (turn_to satellite2 groundstation13 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation13)
   goals met: 0 of 8
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite2 instrument2 groundstation13)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite2 planet16 groundstation13)
   deleted: (pointing satellite2 groundstation13)
   added: (pointing satellite2 planet16)
   goals met: 0 of 8
5. (turn_to satellite1 star2 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star2)
   goals met: 0 of 8
6. (turn_to satellite0 star9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star9)
   goals met: 1 of 8
7. (take_image satellite2 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 2 of 8
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 8
9. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 2 of 8
10. (turn_to satellite1 phenomenon17 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 8
11. (take_image satellite1 phenomenon17 instrument1 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 8
12. (turn_to satellite1 phenomenon20 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon20)
   goals met: 3 of 8
13. (take_image satellite1 phenomenon20 instrument1 thermograph2)
   added: (have_image phenomenon20 thermograph2)
   goals met: 4 of 8
14. (turn_to satellite1 planet15 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
15. (take_image satellite1 planet15 instrument1 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 5 of 8
16. (turn_to satellite1 planet21 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet21)
   goals met: 5 of 8
17. (take_image satellite1 planet21 instrument1 thermograph0)
   added: (have_image planet21 thermograph0)
   goals met: 6 of 8
18. (turn_to satellite1 star18 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star18)
   goals met: 6 of 8
19. (take_image satellite1 star18 instrument1 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 7 of 8
20. (turn_to satellite1 star19 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star19)
   goals met: 7 of 8
21. (take_image satellite1 star19 instrument1 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 8 of 8
